{
	"0.3.4": {
		"date": "Fri, 29 Sep 2023 15:47:26 GMT",
		"changes": "Works"
	},
	"0.3.5": {
		"date": "Fri, 29 Sep 2023 15:51:47 GMT",
		"changes": "nothing"
	},
	"0.3.6": {
		"date": "Tue, 10 Oct 2023 15:56:41 GMT",
		"changes": "Now typescript will not give errors, when you pass your own attributes. Earlier that caused problems with SVGs."
	},
	"0.3.7": {
		"date": "Wed, 11 Oct 2023 13:21:10 GMT",
		"changes": "Another jsx typing changes"
	},
	"0.4.0": {
		"date": "Fri, 16 Feb 2024 10:31:44 GMT",
		"changes": "Now every JSX.Element is a single node. Currently don't know if this change is for worse or for better."
	},
	"0.4.1": {
		"date": "Sun, 25 Feb 2024 05:47:50 GMT",
		"changes": "bug fixes"
	},
	"0.4.2": {
		"date": "Sun, 25 Feb 2024 07:20:39 GMT",
		"changes": "Fixed urls"
	},
	"0.5.0": {
		"date": "Sun, 25 Feb 2024 08:52:38 GMT",
		"changes": "No longer escaping html when setting attributes, because it only led to problems."
	},
	"0.6.0": {
		"date": "Mon, 26 Feb 2024 12:04:31 GMT",
		"changes": "# Fragments are now unwrapped.\r\n\r\nEarlier i made so that every jsx transform into single node, that led to fragments wraping their children into special div.\r\nNow when this special div is passed as child this will result in ignoring it and just passing it's children forward.\r\nNote: fragment will still wrap children if it doen't have jsx parent.\r\n\r\n# Now components treated as functions (currently may leed to unexpected behaviour).\r\n\r\nHow it worked before:\r\nfunction treated as reactive state and will rerender every time signal inside it changes.\r\ncomponents may be seem as functions but actually they are called before passing it as child, resulting in them being just Node, which lead to full app rerenders when some state changed in child component\r\n\r\nHow it works now:\r\nfunctions still function the same\r\ncomponents treated the as functions\r\n\r\nNote: rerender of function will just call it, so if it has signals inside, they will be created again, losing old state"
	},
	"0.6.1": {
		"date": "Mon, 26 Feb 2024 15:26:49 GMT",
		"changes": "Fragment unwrapping led to errors (who could have thought?)\r\nFixed this errors\r\n\r\nTesting components's lifetime events"
	},
	"0.6.2": {
		"date": "Wed, 28 Feb 2024 10:43:00 GMT",
		"changes": "Removed a lot of @ts-ignore.\r\n\r\nFor now lifetime events are removed as they didn't function properly. \\\r\nProbably next update will be fully revolved around them. \\\r\nCurrently don't know how to implement them properly, but one day i will."
	},
	"0.6.3": {
		"date": "Thu, 29 Feb 2024 11:43:42 GMT",
		"changes": ""
	},
	"0.6.4": {
		"date": "Thu, 29 Feb 2024 11:54:14 GMT",
		"changes": "Forgot to replace child in replaceChild function. Oops"
	},
	"0.6.5": {
		"date": "Fri, 01 Mar 2024 12:14:23 GMT",
		"changes": "style attribute type changed so typescript will not give an error when it is a function"
	},
	"0.6.6": {
		"date": "Fri, 01 Mar 2024 12:33:59 GMT",
		"changes": "typescript now will hint names of styles"
	}
}